camel-wsdl-db-orch-route/src/main/resources/vm/requestSenescyt.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://latinus.net/senescyt/types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:cedula>${headers.cedula}</typ:cedula>
   </soapenv:Body>
</soapenv:Envelope>